vietnamese_chars = [
    # A
    'a', 'à', 'á', 'ả', 'ã', 'ạ',
    'ă', 'ằ', 'ắ', 'ẳ', 'ẵ', 'ặ',
    'â', 'ầ', 'ấ', 'ẩ', 'ẫ', 'ậ',
    # B, C, D, Đ
    'b', 'c', 'd', 'đ',
    # E
    'e', 'è', 'é', 'ẻ', 'ẽ', 'ẹ',
    'ê', 'ề', 'ế', 'ể', 'ễ', 'ệ',
    # G, H, I
    'g', 'h',
    'i', 'ì', 'í', 'ỉ', 'ĩ', 'ị',
    # K, L, M, N
    'k', 'l', 'm', 'n',
    # O
    'o', 'ò', 'ó', 'ỏ', 'õ', 'ọ',
    'ô', 'ồ', 'ố', 'ổ', 'ỗ', 'ộ',
    'ơ', 'ờ', 'ớ', 'ở', 'ỡ', 'ợ',
    # P, Q, R, S, T
    'p', 'q', 'r', 's', 't',
    # U
    'u', 'ù', 'ú', 'ủ', 'ũ', 'ụ',
    'ư', 'ừ', 'ứ', 'ử', 'ữ', 'ự',
    # V, X, Y
    'v', 'x',
    'y', 'ỳ', 'ý', 'ỷ', 'ỹ', 'ỵ'
]
